InformationRegisters/ксОчередьОбменов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ксОчередьОбменов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>идОбмена</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>77</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ксОчередьОбменов/Ext/ManagerModule.bsl
Процедура ОбновитьИдИзменния(Вид) Экспорт
	УстановитьПривилегированныйРежим(Истина);  
	
	Зап = РегистрыСведений.ксОчередьОбменов.СоздатьМенеджерЗаписи();
	Зап.ВидОбъекта = нрег(вид);
	Зап.идОбмена = Новый УникальныйИдентификатор;
	Зап.ДатаИзменения = ТекущаяДата();
	Зап.Записать();
	
КонецПроцедуры    

Процедура ЗаписатьИдИзменения(СткИд) Экспорт
	Если СткИд =Неопределено Тогда Возврат; КонецесЛИ;
	
	УстановитьПривилегированныйРежим(Истина);  
	
	Зап = РегистрыСведений.ксОчередьОбменов.СоздатьМенеджерЗаписи(); 
	ЗаполнитьЗначенияСвойств(Зап,СткИд);
	Зап.Записать();
	
КонецПроцедуры    

Функция СписокСтатусаИд() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ксОчередьОбменов.ВидОбъекта КАК ВидОбъекта,
	              |	ксОчередьОбменов.идОбмена КАК идОбмена,
	              |	ксОчередьОбменов.ДатаИзменения КАК ДатаИзменения
	              |ИЗ
	              |	РегистрСведений.ксОчередьОбменов КАК ксОчередьОбменов";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции  


Функция ПроверитьСтатусыИд() Экспорт
	
	Стк = глЛокализацияУсловияСинхронизации.СткПолучитьСоединение();
	
	тблИд = глЗагрузитьОбъекты.сделатьЗапрос("SYNSTATUS",Неопределено);
	
	
	тбл = СписокСтатусаИд();
	
	масВид = новый Массив;
	Для каждого Стр из Тбл Цикл
		нс = тблИд.Найти(Стр.ВидОбъекта);
		Если нс = Неопределено Тогда Продолжить; КонецЕсли;
		Если нс.идОбмена <> стр.идОБмена Тогда
			масВид.добавить(стр.ВидОбъекта);
		КонецеслИ;
		
	Конеццикла; 
	
	Возврат масВид;
	
КонецФункции  

Функция ПолучитьИдОчереди(видОбк) Экспорт   
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("видОбк",нрег(видОбк));
	Запрос.Текст ="ВЫБРАТЬ
	|	ксОчередьОбменов.ВидОбъекта КАК ВидОбъекта,
	|	ксОчередьОбменов.идОбмена КАК идОбмена,
	|	ксОчередьОбменов.ДатаИзменения КАК ДатаИзменения
	|ИЗ
	|	РегистрСведений.ксОчередьОбменов КАК ксОчередьОбменов
	|ГДЕ ВидОбъекта = &видОбк "; 
	Выб = Запрос.Выполнить().Выбрать();
	
	Если Выб.Следующий() Тогда
		Рез =  новый Структура("ВидОбъекта,идОбмена,ДатаИзменения");  
		ЗаполнитьЗначенияСвойств(Рез,Выб);
		Возврат Рез;
	ИНаче
		Возврат Неопределено;
	КонецЕслИ;
	
КонецФункции
